#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ЗарплатнаяВедомость = Выплаты.Выгрузить();
	ЗарплатнаяВедомость.Свернуть("Сотрудник", "Сумма");
	
	Для Каждого ТекущаяСтрока Из ЗарплатнаяВедомость Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекущаяСтрока.Сотрудник;
		Движение.Сумма = ТекущаяСтрока.Сумма;
	    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник) КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Переплата
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Граница, Сотрудник В
	|		(ВЫБРАТЬ
	|			ВКМ_ВыплатаЗарплатыВыплаты.Сотрудник КАК Сотрудник
	|		ИЗ
	|			Документ.ВКМ_ВыплатаЗарплаты.Выплаты КАК ВКМ_ВыплатаЗарплатыВыплаты
	|		ГДЕ
	|			ВКМ_ВыплатаЗарплатыВыплаты.Ссылка = &Ссылка)) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|ГДЕ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = СтрШаблон("У сотрудника %1 сумма выдачи превышает сумму начисления на %2 руб.", Выборка.Сотрудник, -Выборка.Переплата);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры




Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументыСозданныеПослеТекущего() Тогда
		ТекстСообщения = "Документы, созданные после текущего, не могут быть изменены";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;	
		
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументыСозданныеПослеТекущего()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВыплатаЗарплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВКМ_ВыплатаЗарплаты КАК ВКМ_ВыплатаЗарплаты
	|ГДЕ
	|	ВКМ_ВыплатаЗарплаты.Дата >= &Дата
	|	И ВКМ_ВыплатаЗарплаты.Ссылка <> &Ссылка
	|	И ВКМ_ВыплатаЗарплаты.Проведен";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции	

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
