#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Диаграмма.Очистить();

	
	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ТекстСообщения = "Построение диаграммы не возможно. Ошибка получения данных для построения графика.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);  		
	
	Если ГрафикОтпусков.Количество() > 0 И ЗначениеЗаполнено(ГрафикОтпусков[0].ДатаНачала) Тогда
		ГодГрафика = Формат(ГрафикОтпусков[0].ДатаНачала, "ДФ=yyyy");
		Заголовок = "График отпусков на " + ГодГрафика + " год";
	КонецЕсли;
	
	СерияОтпуска = Диаграмма.УстановитьСерию("Отпуска");
	СерияОтпуска.Цвет = WebЦвета.СинеФиолетовый;
	
	СерияПродолжительногоОтпуска = Диаграмма.УстановитьСерию("Отпуск с продолжительностью более 28 дней");
	СерияПродолжительногоОтпуска.Цвет = WebЦвета.Томатный;
	
	КешТочек = Новый Соответствие();
	
	Для Каждого Строка Из ГрафикОтпусков Цикл  
		
		ИмяСотрудника = Строка.Сотрудник.Наименование;
		Точка = КешТочек[ИмяСотрудника];
		Если Точка = Неопределено Тогда
			Точка = Диаграмма.УстановитьТочку(ИмяСотрудника);
			Точка.Текст = ИмяСотрудника;
			КешТочек.Вставить(ИмяСотрудника, Точка);
		КонецЕсли;

		Если Строка.ОбщаяПродолжительностьОтпуска > 28 Тогда 
			Серия = СерияПродолжительногоОтпуска;
		Иначе     
			Серия = СерияОтпуска;
		КонецЕсли;  
		
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;  
		
	КонецЦикла;	  


КонецПроцедуры  

#КонецОбласти
