#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Диаграмма.Очистить();
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ТекстСообщения = "Построение диаграммы не возможно. Ошибка получения данных для построения графика.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес); 		
	Если ГрафикОтпусков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СерияОтпуска = Диаграмма.Серии.Добавить();
	СерияОтпуска.Текст = "Отпуска";
	СерияОтпуска.Цвет = WebЦвета.СинеФиолетовый;
	
	СерияПродолжительногоОтпуска = Диаграмма.Серии.Добавить();
	СерияПродолжительногоОтпуска.Текст = "Отпуск с продолжительностью более 28 дней";
	СерияПродолжительногоОтпуска.Цвет = WebЦвета.Томатный;
	
	КешТочек = Новый Соответствие();
	
	Для Каждого Строка Из ГрафикОтпусков Цикл 
		
		Если НЕ ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяСотрудника = СокрЛП(Строка.Сотрудник.Наименование);
		Если НЕ ЗначениеЗаполнено(ИмяСотрудника) Тогда
			Продолжить;
		КонецЕсли;
		
		Точка = КешТочек[ИмяСотрудника];
		Если Точка = Неопределено Тогда
			Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
			КешТочек.Вставить(ИмяСотрудника, Точка);
		КонецЕсли;

		Если Строка.ОбщаяПродолжительностьОтпуска > 28 Тогда 
			Серия = СерияПродолжительногоОтпуска;
		Иначе    			
			Серия = СерияОтпуска;  
		КонецЕсли;  
		
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Строка.ДатаНачала);
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);  	
	КонецЦикла;
КонецПроцедуры  

#КонецОбласти
