


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если  ОсновныеНачисления.Количество() = 0 И ДополнительныеНачисления.Количество() = 0 Тогда
		ТекстСообщения = "Табличные части документа пустые. Документ не может быть проведен.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;	
	КонецЕсли;

СформироватьДвиженияПоОсновнымНачислениям();
СформироватьДвиженияПоПремииПроцентом();
СформироватьНДФЛ();
СформироватьСторноЗаписи();
	
КонецПроцедуры;



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


		


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияПоОсновнымНачислениям() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_СписокСотрудников
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета = &Оклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокСотрудников.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
		|ПОМЕСТИТЬ ВТ_Оклады
		|ИЗ
		|	ВТ_СписокСотрудников КАК ВТ_СписокСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
		|				&ДатаДокумента,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник КАК Сотрудник
		|					ИЗ
		|						Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления
		|					ГДЕ
		|						ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка = &Ссылка
		|						И ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета = &Оклад)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВТ_СписокСотрудников.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаНачала КАК ПериодДействияНачало,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаОкончания КАК ПериодДействияКонец,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ГрафикРабот КАК ГрафикРабот,
		|	ВЫБОР
		|		КОГДА ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаНачала, МЕСЯЦ, -12), МЕСЯЦ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК БазовыйПериодНачало,
		|	ВЫБОР
		|		КОГДА ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК БазовыйПериодКонец,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка.Дата КАК ПериодРегистрации,
		|	ЕСТЬNULL(ВТ_Оклады.Оклад, 0) КАК Показатель
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оклады КАК ВТ_Оклады
		|		ПО ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник = ВТ_Оклады.Сотрудник
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ДатаДокумента",(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина; 
	
		
	Пока Выборка.Следующий() Цикл 
		
		
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад 
			И Выборка.Показатель = 0 Тогда
			
			Продолжить;
	
		КонецЕсли; 
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;
	   	
	Движения.ВКМ_ОсновныеНачисления.Записать();
КонецПроцедуры 

Процедура СформироватьНДФЛ()
	
	СписокСотрудников = ОсновныеНачисления.Выгрузить(,"Сотрудник"); 
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеНачисления,СписокСотрудников); 
	СписокСотрудников.Свернуть("Сотрудник"); 
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого Сотрудник Из СписокСотрудников  Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить(); 
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;        
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Сотрудник = Сотрудник.Сотрудник;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();	
	
КонецПроцедуры 

Процедура СформироватьДвиженияПоПремииПроцентом()
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого СтрокаТЧ Из ДополнительныеНачисления Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить(); 
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом;
		Движение.ПериодРегистрации = Дата;        
		Движение.Сотрудник = СтрокаТЧ.Сотрудник;
		Движение.Результат = СтрокаТЧ.СуммаНачисления;
		
	КонецЦикла;
	Движения.ВКМ_ДополнительныеНачисления.Записать();	
	
КонецПроцедуры

Процедура СформироватьСторноЗаписи()

СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();

Если Не ЗначениеЗаполнено(СторноЗаписи) Тогда
	Возврат;
КонецЕсли;

Для Каждого Запись Из СторноЗаписи Цикл
	
	Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
	
	ЗаполнитьЗначенияСвойств(Движение, Запись);
	
	Движение.Сторно = Истина;
	Движение.ПериодРегистрации = Дата;
	Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
	Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
	
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();	

	
КонецПроцедуры

Процедура РасчитатьОклады()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК Норма,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор
	|	И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки-1];
		
		Если Выборка.Норма <> 0 Тогда
			Движение.Результат = Движение.Показатель * Выборка.Факт / Выборка.Норма;
		КонецЕсли;
	
	Движение.ОтработаноДней = Выборка.Факт;
	Если Движение.Сторно Тогда
		Движение.Результат = - Движение.Результат;
	    Движение.ОтработаноДней = - Движение.ОтработаноДней;
	КонецЕсли;
	
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
	
	
КонецПроцедуры

Процедура РасчитатьНДФЛ() Экспорт

Запрос = Новый Запрос;
Запрос.Текст="ВЫБРАТЬ
|	ЕСТЬNULL(BKM_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБазаОсновныеНачисления,
|	ЕСТЬNULL(BKM_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки, 0) КАК НомерСтроки
|ПОМЕСТИТЬ ВТ_ОсновныеНачисления
|ИЗ
|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, &Разрезы, Регистратор = &Ссылка
|	И ВидРасчета = &НДФЛ) КАК BKM_УдержанияБазаВКМ_ОсновныеНачисления
|ГДЕ
|	BKM_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор = BKM_УдержанияБазаВКМ_ОсновныеНачисления.РегистраторРазрез
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБазаДополнительныеНачисления,
|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки, 0) КАК НомерСтроки
|ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
|ИЗ
|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, &Разрезы, Регистратор = &Ссылка
|	И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
|ГДЕ
|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РегистраторРазрез
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЕСТЬNULL(ВТ_ДополнительныеНачисления.РезультатБазаДополнительныеНачисления, 0) +
|		ЕСТЬNULL(ВТ_ОсновныеНачисления.РезультатБазаОсновныеНачисления, 0) КАК БазаНДФЛ,
|	BKM_Удержания.НомерСтроки КАК НомерСтроки
|ИЗ
|	РегистрРасчета.ВКМ_Удержания КАК BKM_Удержания
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
|		ПО BKM_Удержания.НомерСтроки = ВТ_ОсновныеНачисления.НомерСтроки
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеНачисления КАК ВТ_ДополнительныеНачисления
|		ПО BKM_Удержания.НомерСтроки = ВТ_ДополнительныеНачисления.НомерСтроки
|ГДЕ
|	BKM_Удержания.ВидРасчета = &НДФЛ
|	И BKM_Удержания.Регистратор = &Ссылка" ;

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("Регистратор");
	
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
	    Движение.Результат = Выборка.БазаНДФЛ *13/100;
	КонецЦикла;
	Движения.ВКМ_Удержания.Записать(,Истина);
КонецПроцедуры

Процедура СформироватьВзаиморасчетыССотрудниками() 
    
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
|	ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0) КАК Сумма
|ПОМЕСТИТЬ ВТ_Результаты
|ИЗ
|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
|ГДЕ
|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВКМ_ДополнительныеНачисления.Сотрудник,
|	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)
|ИЗ
|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
|ГДЕ
|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВКМ_Удержания.Сотрудник,
|	-ЕСТЬNULL(ВКМ_Удержания.Результат, 0)
|ИЗ
|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
|ГДЕ
|	ВКМ_Удержания.Регистратор = &Ссылка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_Результаты.Сотрудник КАК Сотрудник,
|	СУММА(ВТ_Результаты.Сумма) КАК Сумма
|ИЗ
|	ВТ_Результаты КАК ВТ_Результаты
|СГРУППИРОВАТЬ ПО
|	ВТ_Результаты.Сотрудник"; 

Запрос.УстановитьПараметр("Ссылка", Ссылка);

Выборка = Запрос.Выполнить().Выбрать();

Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

Пока Выборка.Следующий() Цикл
	
Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
Движение.Период = Дата;
Движение.Сотрудник = Выборка.Сотрудник;
Движение.Сумма = Выборка.Сумма;

КонецЦикла; 
   
    
КонецПроцедуры
	


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
