#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

Диаграмма.Очистить();

Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
	ТекстСообщения = "Построение диаграммы невозможно. Нет данных для построения диаграммы.";
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Возврат;
КонецЕсли;

ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);

Отпуск = Диаграмма.Серии.Добавить();
Отпуск.Текст = "Отпуск";
Отпуск.Цвет = WebЦвета.Зеленый;

ПродолжительныйОтпуск = Диаграмма.Серии.Добавить();
ПродолжительныйОтпуск.Текст = "Продолжительный отпуск более 28 дней";
ПродолжительныйОтпуск.Цвет = WebЦвета.Красный;

Для Каждого СтрокаОтпуска Из ГрафикОтпусков Цикл
	
	Точка = Диаграмма.УстановитьТочку(СтрокаОтпуска.Сотрудник);
	
	Если СтрокаОтпуска.ОбщаяПродолжительностьОтпуска > 28 Тогда
		Серия = ПродолжительныйОтпуск;
	Иначе
		Серия = Отпуск;
	КонецЕсли;
	
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	
	Интервал = Значение.Добавить();
	Интервал.Начало = НачалоДня(СтрокаОтпуска.ДатаНачала);	Интервал.Конец = КонецДня(СтрокаОтпуска.ДатаОкончания);
	КонецЦикла;


КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
