#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ДатыЗаполненыВерно() Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеНачисления

&НаКлиенте
Асинх Процедура ОсновныеНачисленияВидРасчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;
	Если ТекущиеДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск") 
		И ТекущиеДанные.ГрафикРабот <> ПолучитьГрафикРаботОтпуска() Тогда
		
			Результат = Ждать ВопросАсинх("Установить график работ - ОтпускКалендарныеДни?",
			РежимДиалогаВопрос.ДаНет, , , "Вопрос.");	
			
			Если Результат = КодВозвратаДиалога.Да Тогда				
				ТекущиеДанные.ГрафикРабот = ПолучитьГрафикРаботОтпуска();			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда)
	
	Если Объект.ОсновныеНачисления.Количество() <> 0 ИЛИ Объект.ДополнительныеНачисления.Количество() <> 0 Тогда
		Результат = Ждать ВопросАсинх("Табличные части будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Вопрос.");
		Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.ОсновныеНачисления.Очистить();
	Объект.ДополнительныеНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&НачалоПериода, ) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	НЕ ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ВыполненныеСотрудникомРаботы.ЧасовКОплате) КАК ЧасовКОплате,
	|	СУММА(ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплате) КАК СуммаКОплате
	|ПОМЕСТИТЬ ВТ_Корректировка
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК ВКМ_ВыполненныеСотрудникомРаботы
	|ГДЕ
	|	ВКМ_ВыполненныеСотрудникомРаботы.Регистратор = &Ссылка
	|	И ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник В
	|		(ВЫБРАТЬ
	|			ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТ_Сотрудники КАК ВТ_Сотрудники)
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ГрафикРабот,
	|		ЗНАЧЕНИЕ(Справочник.ВКМ_ГрафикиРабот.ПустаяСсылка)) КАК ГрафикРабот,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты.ЧасовКОплатеОборот, 0) +
	|		ЕСТЬNULL(ВТ_Корректировка.ЧасовКОплате, 0) +
	|		ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты.ЧасовКОплатеНачальныйОстаток, 0) КАК НачисленоЧасов,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты.СуммаКОплатеОборот, 0) +
	|		ЕСТЬNULL(ВТ_Корректировка.СуммаКОплате, 0) +
	|		ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты.СуммаКОплатеНачальныйОстаток, 0) КАК СуммаНачисления,
	|	&НачалоПериода КАК ДатаНачала,
	|	&КонецПериода КАК ДатаОкончания,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад) КАК ВидРасчета,
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_Сотрудники.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода,,,
	|			Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты
	|		ПО ВТ_Сотрудники.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корректировка КАК ВТ_Корректировка
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_Корректировка.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ОсновныеНачисления.Добавить(), Выборка);
		Если Выборка.СуммаНачисления <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект.ДополнительныеНачисления.Добавить(), Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДатыЗаполненыВерно()

	Результат = Истина;
	Для Каждого СтрокаТЧ Из Объект.ОсновныеНачисления Цикл
		Если СтрокаТЧ.ДатаНачала > СтрокаТЧ.ДатаОкончания Тогда
			Результат = Ложь;
			ТекстСообщения = "Даты заполнены неправильно! Или дата начала больше даты окончания.";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.ОсновныеНачисления[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧДЦ=0; ЧГ=0") + " ].ДатаНачала");
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

&НаСервере
Функция ПолучитьГрафикРаботОтпуска()
	Возврат Константы.ВКМ_ГрафикОтпуска.Получить();
КонецФункции



#КонецОбласти
