#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ГрафикСуществует() Тогда
		ТекстСообщения = СтрШаблон("График на %1 год уже существует", Формат(Год, "ЧГ=0"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Год",, Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
    |	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
    |		ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1) КАК ПродолжительностьОтпуска
    |ИЗ
    |	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
    |ГДЕ
    |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
    |СГРУППИРОВАТЬ ПО
    |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник";
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();
    
    Движения.ВКМ_СведенияОбОтпусках.Записывать = Истина;
    
    Пока Выборка.Следующий() Цикл
        Движение = Движения.ВКМ_СведенияОбОтпусках.Добавить();
        Движение.Период = Дата;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.Год = Год;
        Движение.ПродолжительностьОтпуска = Выборка.ПродолжительностьОтпуска;
    
    КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ГрафикСуществует() Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |	ВКМ_ГрафикОтпусков.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ВКМ_ГрафикОтпусков КАК ВКМ_ГрафикОтпусков
    |ГДЕ
    |	ВКМ_ГрафикОтпусков.Год = &Год
    |	И ВКМ_ГрафикОтпусков.Ссылка <> &Ссылка";
    
    Запрос.УстановитьПараметр("Год", Год);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Возврат Выборка.Следующий();	

КонецФункции
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
