// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(ГрафикРабот) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран график работы!",,"ГрафикРаботы");
	    Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Или Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период!",,"Период");
	    Возврат;
	КонецЕсли;
		
	ЗаполнитьНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Заполнение графика работы завершено!");
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ЗаполнитьГрафик(Период.ДатаНачала, Период.ДатаОкончания, ГрафикРабот, ВыходныеДниПоДнямНедели);
КонецПроцедуры
#КонецОбласти

