#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьНовыеРеквизитыФормы();
	ДобавитьНовыеЭлементыФормы();
	
КонецПроцедуры
 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
 	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ТекущийОбъект.ВКМ_ДатаНачалаДействияДоговора = Объект.ПериодДействияДоговора.ДатаНачала;
		ТекущийОбъект.ВКМ_ДатаОкончанияДействияДоговора = Объект.ПериодДействияДоговора.ДатаОкончания;
	Иначе
		ТекущийОбъект.ВКМ_ДатаНачалаДействияДоговора = Дата(1, 1, 1);
		ТекущийОбъект.ВКМ_ДатаОкончанияДействияДоговора = Дата(1, 1, 1);
		ТекущийОбъект.ВКМ_АбонентскаяПлата = 0;
		ТекущийОбъект.ВКМ_СтоимостьЧасаРаботыСпециалиста = 0;
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеРеквизитыФормы()

	ДобавляемыеРеквизиты = Новый Массив;
	Реквизит_ПериодДействияДоговора = Новый РеквизитФормы(
		"ПериодДействияДоговора",
		Новый ОписаниеТипов("СтандартныйПериод"));
	ДобавляемыеРеквизиты.Добавить(Реквизит_ПериодДействияДоговора);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	ЭтотОбъект.ПериодДействияДоговора.ДатаНачала = НачалоДня(Объект.ВКМ_ДатаНачалаДействияДоговора);
	ЭтотОбъект.ПериодДействияДоговора.ДатаОкончания = КонецДня(Объект.ВКМ_ДатаОкончанияДействияДоговора);
 
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементыФормы()

	Если Элементы.Найти("ГруппаПрограммноСозданныеЭлементыФормы") = Неопределено Тогда
		ГруппаПрограммноСозданныеЭлементыФормы = Элементы.Добавить(
			"ГруппаПрограммноСозданныеЭлементыФормы",
			Тип("ГруппаФормы"),
			ЭтотОбъект);
		ГруппаПрограммноСозданныеЭлементыФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПрограммноСозданныеЭлементыФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПрограммноСозданныеЭлементыФормы.ОтображатьЗаголовок = Ложь;
		ГруппаПрограммноСозданныеЭлементыФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
	КонецЕсли;
	
	Если Элементы.Найти("АбонентскаяПлата") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить(
			"АбонентскаяПлата",
			Тип("ПолеФормы"),
			ГруппаПрограммноСозданныеЭлементыФормы);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Абонентская плата";
	КонецЕсли;
	
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить(
			"СтоимостьЧасаРаботы",
			Тип("ПолеФормы"),
			ГруппаПрограммноСозданныеЭлементыФормы);		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";  
	КонецЕсли;
	
	Если Элементы.Найти("ПериодДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить(
			"ПериодДействияДоговора",
			Тип("ПолеФормы"),
			ГруппаПрограммноСозданныеЭлементыФормы);
		НовыйЭлемент.ПутьКДанным = "ПериодДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Период действия договора";
	КонецЕсли;
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
	
	УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНовыхЭлементовФормы(Форма)
		
	Форма.Элементы.ГруппаПрограммноСозданныеЭлементыФормы.Видимость =
		Форма.Объект.ВидДоговора = ПредопределенноеЗначение(
			"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
			
КонецПроцедуры

#КонецОбласти
