#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Асинх Процедура Заполнить(Команда)
	
	Если Объект.Выплаты.Количество() <> 0 Тогда
		Результат = Ждать ВопросАсинх("Табличная часть будет очищена. Продолжить?", 
		РежимДиалогаВопрос.ДаНет,,,"Вопрос.");
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Объект.Выплаты.Очистить();
		
	ЗаполнитьНаСервере();
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
|	ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток, 0) КАК Сумма
|ИЗ
|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
|ГДЕ
|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0";

Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);

РезультатЗапроса = Запрос.Выполнить();

Если РезультатЗапроса.Пустой() Тогда
	ТекстСообщения = "Нет данных для заполнения.";
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Возврат;
КонецЕсли;

Выборка = РезультатЗапроса.Выбрать();

Пока Выборка.Следующий() Цикл
	ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), Выборка);
КонецЦикла;		

КонецПроцедуры

#КонецОбласти
