#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Объект.Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Объект.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Период) И (Объект.Период.ДатаНачала <> НачалоМесяца(Объект.Период.ДатаНачала) 
	    ИЛИ Объект.Период.ДатаОкончания <> КонецМесяца(Объект.Период.ДатаОкончания)) Тогда		
		Объект.Период.ДатаНачала = НачалоМесяца(Объект.Период.ДатаНачала);		Объект.Период.ДатаОкончания = КонецМесяца(Объект.Период.ДатаОкончания);		
		ТекстСообщения = СтрШаблон("Период обработки изменен кратно месяцу: %1 - %2", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.Период");
	
	КонецЕсли;
Объект.СписокДоговоровИРеализаций.Очистить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните период создания актов реализации товаров и услуг.
		|Обработка не запущена!",,"Объект.Период");
		Возврат;
	КонецЕсли;
	Если КонецМесяца(Объект.Период.ДатаНачала) <> КонецМесяца(Объект.Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период создания актов реализации товаров и услуг должен быть кратен месяцу.
		                                            |Обработка не запущена!",,"Объект.Период");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьДокументыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Истина);
	Оповещение = Новый ОписаниеОповещения("ПолучитьСписокДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры	

&НаСервере
Функция СоздатьДокументыНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокДокументовРеализации	", 
	                                                                  Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
КонецФункции


&НаКлиенте
Процедура ПолучитьСписокДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	Возврат;
	КонецЕсли;
	
	Если Результат.Статус = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка отменена пользователем");
		Возврат;
	КонецЕсли;
	
	РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Объект.СписокДоговоровИРеализаций.Очистить();
	Если РезультатОбработки.ДокументовСоздано = 0 И РезультатОбработки.ДокументовНеСоздано = 0 Тогда
		ТекстСообщения = "Дя выбранного периода не найдено документов реализации по абонетским договорам, или нет действующих договоров";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ЗаписатьСписокДокументов(РезультатОбработки.МассивДокументов);
	ТекстСообщения = СтрШаблон("Для выбранного периода создано %1 документов, не создано %2 документов", РезультатОбработки.ДокументовСоздано, РезультатОбработки.ДокументовНеСоздано);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСписокДокументов(МассивДокументов)
	
	Для Каждого Документ Из МассивДокументов Цикл
		НоваяСтрока = Объект.СписокДоговоровИРеализаций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Документ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти





